In [1]:
import os
import pandas as pd
import numpy as np
from IPython import InteractiveShell

from util.ConstUtil import DATA_PATH

InteractiveShell.ast_node_interactivity = "all"
%matplotlib auto

Using matplotlib backend: Qt5Agg

In [2]:
data_path = os.path.join(DATA_PATH, 'pandas_rs')
fpath = os.path.join(data_path, 'pandas120.xlsx')
df:pd.DataFrame = pd.read_excel(fpath)
df.head()

           createTime education   salary
0 2020-03-16 11:30:18        本科  20k-35k
1 2020-03-16 10:58:48        本科  20k-40k
2 2020-03-16 10:46:39        不限  20k-35k
3 2020-03-16 10:45:44        本科  13k-20k
4 2020-03-16 10:20:41        本科  10k-20k

In [3]:
def _f(drow):
	lst:list = drow['salary'].split('-')
	smin = int(lst[0].strip('k'))
	smax = int(lst[1].strip('k'))
	return int((smin + smax) / 2 * 1000)

df['salary1'] = df.apply(_f, axis=1)
df

             createTime education   salary  salary1
0   2020-03-16 11:30:18        本科  20k-35k    27500
1   2020-03-16 10:58:48        本科  20k-40k    30000
2   2020-03-16 10:46:39        不限  20k-35k    27500
3   2020-03-16 10:45:44        本科  13k-20k    16500
4   2020-03-16 10:20:41        本科  10k-20k    15000
..                  ...       ...      ...      ...
130 2020-03-16 11:36:07        本科  10k-18k    14000
131 2020-03-16 09:54:47        硕士  25k-50k    37500
132 2020-03-16 10:48:32        本科  20k-40k    30000
133 2020-03-16 10:46:31        本科  15k-23k    19000
134 2020-03-16 11:19:38        本科  20k-40k    30000

[135 rows x 4 columns]

In [4]:
import re
df['salary2'] = 0
for index, row in df.iterrows():
	nums = re.findall('\d+', row[2])
	df.loc[index,'salary2'] = (int(nums[0]) + int(nums[1])) / 2 * 1000
df

             createTime education   salary  salary1  salary2
0   2020-03-16 11:30:18        本科  20k-35k    27500    27500
1   2020-03-16 10:58:48        本科  20k-40k    30000    30000
2   2020-03-16 10:46:39        不限  20k-35k    27500    27500
3   2020-03-16 10:45:44        本科  13k-20k    16500    16500
4   2020-03-16 10:20:41        本科  10k-20k    15000    15000
..                  ...       ...      ...      ...      ...
130 2020-03-16 11:36:07        本科  10k-18k    14000    14000
131 2020-03-16 09:54:47        硕士  25k-50k    37500    37500
132 2020-03-16 10:48:32        本科  20k-40k    30000    30000
133 2020-03-16 10:46:31        本科  15k-23k    19000    19000
134 2020-03-16 11:19:38        本科  20k-40k    30000    30000

[135 rows x 5 columns]

In [5]:
df.groupby('education').mean()

                salary1       salary2
education
不限         19600.000000  19600.000000
大专         10000.000000  10000.000000
本科         19361.344538  19361.344538
硕士         20642.857143  20642.857143

In [6]:
df['date'] = df['createTime'].apply(lambda x: x.to_pydatetime().strftime("%m-%d"))
df
df.info

             createTime education   salary  salary1  salary2   date
0   2020-03-16 11:30:18        本科  20k-35k    27500    27500  03-16
1   2020-03-16 10:58:48        本科  20k-40k    30000    30000  03-16
2   2020-03-16 10:46:39        不限  20k-35k    27500    27500  03-16
3   2020-03-16 10:45:44        本科  13k-20k    16500    16500  03-16
4   2020-03-16 10:20:41        本科  10k-20k    15000    15000  03-16
..                  ...       ...      ...      ...      ...    ...
130 2020-03-16 11:36:07        本科  10k-18k    14000    14000  03-16
131 2020-03-16 09:54:47        硕士  25k-50k    37500    37500  03-16
132 2020-03-16 10:48:32        本科  20k-40k    30000    30000  03-16
133 2020-03-16 10:46:31        本科  15k-23k    19000    19000  03-16
134 2020-03-16 11:19:38        本科  20k-40k    30000    30000  03-16

[135 rows x 6 columns]

<bound method DataFrame.info of              createTime education   salary  salary1  salary2   date
0   2020-03-16 11:30:18        本科  20k-35k    27500    27500  03-16
1   2020-03-16 10:58:48        本科  20k-40k    30000    30000  03-16
2   2020-03-16 10:46:39        不限  20k-35k    27500    27500  03-16
3   2020-03-16 10:45:44        本科  13k-20k    16500    16500  03-16
4   2020-03-16 10:20:41        本科  10k-20k    15000    15000  03-16
..                  ...       ...      ...      ...      ...    ...
130 2020-03-16 11:36:07        本科  10k-18k    14000    14000  03-16
131 2020-03-16 09:54:47        硕士  25k-50k    37500    37500  03-16
132 2020-03-16 10:48:32        本科  20k-40k    30000    30000  03-16
133 2020-03-16 10:46:31        本科  15k-23k    19000    19000  03-16
134 2020-03-16 11:19:38        本科  20k-40k    30000    30000  03-16

[135 rows x 6 columns]>

In [7]:
bins = [0, 5000, 20000, 50000]
group_names = ['低', '中', '高']
df['categories'] = pd.cut(df['salary1'], bins, labels=group_names)
df

             createTime education   salary  salary1  salary2   date categories
0   2020-03-16 11:30:18        本科  20k-35k    27500    27500  03-16          高
1   2020-03-16 10:58:48        本科  20k-40k    30000    30000  03-16          高
2   2020-03-16 10:46:39        不限  20k-35k    27500    27500  03-16          高
3   2020-03-16 10:45:44        本科  13k-20k    16500    16500  03-16          中
4   2020-03-16 10:20:41        本科  10k-20k    15000    15000  03-16          中
..                  ...       ...      ...      ...      ...    ...        ...
130 2020-03-16 11:36:07        本科  10k-18k    14000    14000  03-16          中
131 2020-03-16 09:54:47        硕士  25k-50k    37500    37500  03-16          高
132 2020-03-16 10:48:32        本科  20k-40k    30000    30000  03-16          高
133 2020-03-16 10:46:31        本科  15k-23k    19000    19000  03-16          中
134 2020-03-16 11:19:38        本科  20k-40k    30000    30000  03-16          高

[135 rows x 7 columns]

In [8]:
df.sort_values(by='salary1', ascending=False)

             createTime education   salary  salary1  salary2   date categories
53  2020-03-16 11:30:17        本科  30k-60k    45000    45000  03-16          高
37  2020-03-16 11:04:00        本科  30k-50k    40000    40000  03-16          高
101 2020-03-16 11:01:39        本科  30k-45k    37500    37500  03-16          高
16  2020-03-16 10:36:57        本科  25k-50k    37500    37500  03-16          高
131 2020-03-16 09:54:47        硕士  25k-50k    37500    37500  03-16          高
..                  ...       ...      ...      ...      ...    ...        ...
123 2020-03-16 11:20:44        本科    3k-6k     4500     4500  03-16          低
126 2020-03-16 11:12:04        本科    3k-5k     4000     4000  03-16          低
110 2020-03-16 11:12:04        本科    3k-5k     4000     4000  03-16          低
96  2020-03-16 10:44:23        不限    3k-4k     3500     3500  03-16          低
113 2020-03-16 10:48:43        本科    3k-4k     3500     3500  03-16          低

[135 rows x 7 columns]

In [9]:
np.median(df['salary1'])

17500.0

In [10]:
df.salary1.plot(kind='hist')

In [11]:
df.salary1.plot(kind='kde',xlim=(0,80000))

In [12]:
df.drop(columns='salary2', inplace=True)
df

             createTime education   salary  salary1   date categories
0   2020-03-16 11:30:18        本科  20k-35k    27500  03-16          高
1   2020-03-16 10:58:48        本科  20k-40k    30000  03-16          高
2   2020-03-16 10:46:39        不限  20k-35k    27500  03-16          高
3   2020-03-16 10:45:44        本科  13k-20k    16500  03-16          中
4   2020-03-16 10:20:41        本科  10k-20k    15000  03-16          中
..                  ...       ...      ...      ...    ...        ...
130 2020-03-16 11:36:07        本科  10k-18k    14000  03-16          中
131 2020-03-16 09:54:47        硕士  25k-50k    37500  03-16          高
132 2020-03-16 10:48:32        本科  20k-40k    30000  03-16          高
133 2020-03-16 10:46:31        本科  15k-23k    19000  03-16          中
134 2020-03-16 11:19:38        本科  20k-40k    30000  03-16          高

[135 rows x 6 columns]

In [13]:
df['combine1'] = df['education'] + df['date']
df

df['combine2'] = df['salary1'].map(str) + df['education']
df

             createTime education   salary  salary1   date categories combine1
0   2020-03-16 11:30:18        本科  20k-35k    27500  03-16          高  本科03-16
1   2020-03-16 10:58:48        本科  20k-40k    30000  03-16          高  本科03-16
2   2020-03-16 10:46:39        不限  20k-35k    27500  03-16          高  不限03-16
3   2020-03-16 10:45:44        本科  13k-20k    16500  03-16          中  本科03-16
4   2020-03-16 10:20:41        本科  10k-20k    15000  03-16          中  本科03-16
..                  ...       ...      ...      ...    ...        ...      ...
130 2020-03-16 11:36:07        本科  10k-18k    14000  03-16          中  本科03-16
131 2020-03-16 09:54:47        硕士  25k-50k    37500  03-16          高  硕士03-16
132 2020-03-16 10:48:32        本科  20k-40k    30000  03-16          高  本科03-16
133 2020-03-16 10:46:31        本科  15k-23k    19000  03-16          中  本科03-16
134 2020-03-16 11:19:38        本科  20k-40k    30000  03-16          高  本科03-16

[135 rows x 7 columns]

,createTime,education,salary,salary1,date,categories,combine1,combine2
0,2020-03-16 11:30:18,本科,20k-35k,27500,03-16,高,本科03-16,27500本科
1,2020-03-16 10:58:48,本科,20k-40k,30000,03-16,高,本科03-16,30000本科
2,2020-03-16 10:46:39,不限,20k-35k,27500,03-16,高,不限03-16,27500不限
3,2020-03-16 10:45:44,本科,13k-20k,16500,03-16,中,本科03-16,16500本科
4,2020-03-16 10:20:41,本科,10k-20k,15000,03-16,中,本科03-16,15000本科
...,...,...,...,...,...,...,...,...
130,2020-03-16 11:36:07,本科,10k-18k,14000,03-16,中,本科03-16,14000本科
131,2020-03-16 09:54:47,硕士,25k-50k,37500,03-16,高,硕士03-16,37500硕士
132,2020-03-16 10:48:32,本科,20k-40k,30000,03-16,高,本科03-16,30000本科
133,2020-03-16 10:46:31,本科,15k-23k,19000,03-16,中,本科03-16,19000本科
134,2020-03-16 11:19:38,本科,20k-40k,30000,03-16,高,本科03-16,30000本科

In [14]:
df[['salary1']].apply(lambda x:x.max() - x.min())

salary1    41500
dtype: int64

In [15]:
pd.concat([df[:1], df[-1:]])

,createTime,education,salary,salary1,date,categories,combine1,combine2
0,2020-03-16 11:30:18,本科,20k-35k,27500,03-16,高,本科03-16,27500本科
134,2020-03-16 11:19:38,本科,20k-40k,30000,03-16,高,本科03-16,30000本科

In [16]:
df.append(df.iloc[7])

,createTime,education,salary,salary1,date,categories,combine1,combine2
0,2020-03-16 11:30:18,本科,20k-35k,27500,03-16,高,本科03-16,27500本科
1,2020-03-16 10:58:48,本科,20k-40k,30000,03-16,高,本科03-16,30000本科
2,2020-03-16 10:46:39,不限,20k-35k,27500,03-16,高,不限03-16,27500不限
3,2020-03-16 10:45:44,本科,13k-20k,16500,03-16,中,本科03-16,16500本科
4,2020-03-16 10:20:41,本科,10k-20k,15000,03-16,中,本科03-16,15000本科
...,...,...,...,...,...,...,...,...
131,2020-03-16 09:54:47,硕士,25k-50k,37500,03-16,高,硕士03-16,37500硕士
132,2020-03-16 10:48:32,本科,20k-40k,30000,03-16,高,本科03-16,30000本科
133,2020-03-16 10:46:31,本科,15k-23k,19000,03-16,中,本科03-16,19000本科
134,2020-03-16 11:19:38,本科,20k-40k,30000,03-16,高,本科03-16,30000本科
7,2020-03-16 09:49:12,本科,10k-15k,12500,03-16,中,本科03-16,12500本科

In [18]:
df.set_index('createTime')

,education,salary,salary1,date,categories,combine1,combine2
createTime,,,,,,,
2020-03-16 11:30:18,本科,20k-35k,27500,03-16,高,本科03-16,27500本科
2020-03-16 10:58:48,本科,20k-40k,30000,03-16,高,本科03-16,30000本科
2020-03-16 10:46:39,不限,20k-35k,27500,03-16,高,不限03-16,27500不限
2020-03-16 10:45:44,本科,13k-20k,16500,03-16,中,本科03-16,16500本科
2020-03-16 10:20:41,本科,10k-20k,15000,03-16,中,本科03-16,15000本科
...,...,...,...,...,...,...,...
2020-03-16 11:36:07,本科,10k-18k,14000,03-16,中,本科03-16,14000本科
2020-03-16 09:54:47,硕士,25k-50k,37500,03-16,高,硕士03-16,37500硕士
2020-03-16 10:48:32,本科,20k-40k,30000,03-16,高,本科03-16,30000本科
2020-03-16 10:46:31,本科,15k-23k,19000,03-16,中,本科03-16,19000本科
2020-03-16 11:19:38,本科,20k-40k,30000,03-16,高,本科03-16,30000本科

In [19]:
df1 = pd.DataFrame(np.zeros(len(df)))
df1

df = pd.concat([df,df1], axis=1)
df

       0
0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
..   ...
130  0.0
131  0.0
132  0.0
133  0.0
134  0.0

[135 rows x 1 columns]

,createTime,education,salary,salary1,date,categories,combine1,combine2,0
0,2020-03-16 11:30:18,本科,20k-35k,27500,03-16,高,本科03-16,27500本科,0.0
1,2020-03-16 10:58:48,本科,20k-40k,30000,03-16,高,本科03-16,30000本科,0.0
2,2020-03-16 10:46:39,不限,20k-35k,27500,03-16,高,不限03-16,27500不限,0.0
3,2020-03-16 10:45:44,本科,13k-20k,16500,03-16,中,本科03-16,16500本科,0.0
4,2020-03-16 10:20:41,本科,10k-20k,15000,03-16,中,本科03-16,15000本科,0.0
...,...,...,...,...,...,...,...,...,...
130,2020-03-16 11:36:07,本科,10k-18k,14000,03-16,中,本科03-16,14000本科,0.0
131,2020-03-16 09:54:47,硕士,25k-50k,37500,03-16,高,硕士03-16,37500硕士,0.0
132,2020-03-16 10:48:32,本科,20k-40k,30000,03-16,高,本科03-16,30000本科,0.0
133,2020-03-16 10:46:31,本科,15k-23k,19000,03-16,中,本科03-16,19000本科,0.0
134,2020-03-16 11:19:38,本科,20k-40k,30000,03-16,高,本科03-16,30000本科,0.0

In [20]:
df.isnull().values.any()

False

In [24]:
df.dtypes
aa = df.salary1.astype(np.float64)
aa.dtypes

createTime    datetime64[ns]
education             object
salary                object
salary1                int64
date                  object
categories          category
combine1              object
combine2              object
dtype: object

dtype('float64')

In [27]:
len(df[df['salary1']>10000])

df.education.value_counts()

df.education.nunique()

119

本科    119
硕士      7
不限      5
大专      4
Name: education, dtype: int64

4

In [41]:
df['new'] = df['salary1'] - df[0]
df1 = df[['salary1', 'new']]
rowsum = df1.apply(np.sum, axis=1)
type(rowsum)

idx = np.where(rowsum > 60000)[0]
idx

res = df.iloc[idx[-3:]]
res

pandas.core.series.Series

array([ 16,  18,  37,  53,  62,  79,  92, 101, 131], dtype=int64)

,createTime,education,salary,salary1,date,categories,combine1,combine2,0,new
92,2020-03-16 10:41:20,本科,30k-40k,35000,03-16,高,本科03-16,35000本科,0.0,35000.0
101,2020-03-16 11:01:39,本科,30k-45k,37500,03-16,高,本科03-16,37500本科,0.0,37500.0
131,2020-03-16 09:54:47,硕士,25k-50k,37500,03-16,高,硕士03-16,37500硕士,0.0,37500.0